{"keras_version": "2.0.2", "config": [{"class_name": "GlobalAveragePooling2D", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 1, 2048], "trainable": true, "name": "global_average_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "units": 133, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_regularizer": null}}], "backend": "tensorflow", "class_name": "Sequential"}